scripts/artillery-light.yaml
config:
  target: "http://localhost:8082"
  http:
    timeout: 10
  phases:
    - duration: 350
      arrivalRate: 5
      rampTo: 120

  defaults:
    headers:
      Content-Type: application/json
  plugins:
    expect: {}

scenarios:
  - name: POST /propose
    flow:
      - post:
          url: "/propose"
          json: {}
          expect:
            - statusCode: 200