scripts/artillery.yaml
config:
  target: "http://localhost:8085"
  http:
    timeout: 120
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 30

    - name: sustain
      duration: 60
      arrivalRate: 30

  defaults:
    headers:
      Content-Type: application/json
  plugins:
    expect: {}

scenarios:
  - name: POST /propose
    flow:
      - post:
          url: "/propose"
          json: {}
          expect:
            - statusCode: 200